In [1]:
import pandas as pd
import numpy as np

In [3]:
my_array = [{'name':'lillian', 'age': 31, 'city':'paris', 'love': 'reading'},
            {'name':'james', 'age': 32, 'city': 'kampala', 'love': 'real madrid'},
            {'name':'bernard', 'age': 33, 'city': 'kangulumira', 'love': 'soccer'}]
len(my_array)

3

In [5]:
my_df = pd.DataFrame(my_array)
my_df

      name  age         city         love
0  lillian   31        paris      reading
1    james   32      kampala  real madrid
2  bernard   33  kangulumira       soccer

In [7]:
my_df.to_csv('../models/trial.csv', index=False)